Revit 2027 API
ElectricalLoadClassification.SpaceLoadClass Property
 The electrical load class associated with a space.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElectricalLoadClassificationSpace SpaceLoadClass { get; set; }
Public Property SpaceLoadClass As ElectricalLoadClassificationSpace
	Get
	Set
public:
property ElectricalLoadClassificationSpace SpaceLoadClass {
	ElectricalLoadClassificationSpace get ();
	void set (ElectricalLoadClassificationSpace value);
}
member SpaceLoadClass : ElectricalLoadClassificationSpace with get, set
Property Value
ElectricalLoadClassificationSpace
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ElectricalLoadClassification Class
Autodesk.Revit.DB.Electrical Namespace